<a href="https://colab.research.google.com/github/tashramsden/100_days_python/blob/main/day-71_data_science_pandas/Day_71_Data_Exploration_Pandas_College_Major.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Data Exploration with Pandas**

**Summary**

*  Use .head(), .tail(), .shape and .columns to explore your DataFrame and 
find out the number of rows and columns as well as the column names.

*  Look for NaN (not a number) values with .isna() and consider using .dropna() to clean up your DataFrame.

*  You can access entire columns of a DataFrame using the square bracket notation: df['column name'] or df[['column name 1', 'column name 2', 'column name 3']]

*  You can access individual cells in a DataFrame by chaining square brackets df['column name'][index] or using df['column name'].loc[index]

*  The largest and smallest values, as well as their positions, can be found with methods like .max(), .min(), .idxmax() and .idxmin()

*  You can sort the DataFrame with .sort_values() and add new columns with .insert()

*  To create an Excel Style Pivot Table by grouping entries that belong to a particular category use the .groupby() method

Bring up documentation in notebook - highlight function and press shift + tab

In [ ]:
import pandas as pd

Get Pandas to print numbers with commas eg 1,012.45 rather than 1012.45

In [ ]:
pd.options.display.float_format = '{:,.2f}'.format

Read csv

In [ ]:
df = pd.read_csv("salaries_by_college_major.csv")

In [ ]:
df.head()

     Undergraduate Major  ...     Group
0             Accounting  ...  Business
1  Aerospace Engineering  ...      STEM
2            Agriculture  ...  Business
3           Anthropology  ...      HASS
4           Architecture  ...  Business

[5 rows x 6 columns]

In [ ]:
df.shape  # returns the no of rows and columns in the dataframe

(51, 6)

In [ ]:
df.columns  # returns the names of the columns

Index(['Undergraduate Major', 'Starting Median Salary',
       'Mid-Career Median Salary', 'Mid-Career 10th Percentile Salary',
       'Mid-Career 90th Percentile Salary', 'Group'],
      dtype='object')

In [ ]:
df.isna()  # checks for NaN (not a number)

In [ ]:
df.tail()  # last row has info about source of data - need to remove!

      Undergraduate Major  ...  Group
46             Psychology  ...   HASS
47               Religion  ...   HASS
48              Sociology  ...   HASS
49                Spanish  ...   HASS
50  Source: PayScale Inc.  ...    NaN

[5 rows x 6 columns]

In [ ]:
clean_df = df.dropna()  # removes the row w NaN values (could also manually remove row at index 50)

In [ ]:
clean_df.tail()  # NaN row has been removed

   Undergraduate Major  ...  Group
45   Political Science  ...   HASS
46          Psychology  ...   HASS
47            Religion  ...   HASS
48           Sociology  ...   HASS
49             Spanish  ...   HASS

[5 rows x 6 columns]

**Find college major with the highest starting salary**

In [ ]:
clean_df['Starting Median Salary']  # access this column

0    46,000.00
1    57,700.00
2    42,600.00
3    36,800.00
4    41,600.00
5    35,800.00
6    38,800.00
7    43,000.00
8    63,200.00
9    42,600.00
10   53,900.00
11   38,100.00
12   61,400.00
13   55,900.00
14   53,700.00
15   35,000.00
16   35,900.00
17   50,100.00
18   34,900.00
19   60,900.00
20   38,000.00
21   37,900.00
22   47,900.00
23   39,100.00
24   41,200.00
25   43,500.00
26   35,700.00
27   38,800.00
28   39,200.00
29   37,800.00
30   57,700.00
31   49,100.00
32   36,100.00
33   40,900.00
34   35,600.00
35   49,200.00
36   40,800.00
37   45,400.00
38   57,900.00
39   35,900.00
40   54,200.00
41   39,900.00
42   39,900.00
43   74,300.00
44   50,300.00
45   40,800.00
46   35,900.00
47   34,100.00
48   36,500.00
49   34,000.00
Name: Starting Median Salary, dtype: float64

In [ ]:
clean_df['Starting Median Salary'].max()  # find highest starting salary =$74300, but who does this belong to?

74300.0

In [ ]:
clean_df['Starting Median Salary'].idxmax()  # returns index for the row with the largest value

43

In [ ]:
clean_df['Undergraduate Major'].loc[43]  # returns the major of the student in that row

'Physician Assistant'

In [ ]:
clean_df['Undergraduate Major'][43]  # this does exaclty the same as above

'Physician Assistant'

In [ ]:
clean_df.loc[43]  # this retrieves the whole row of that student

Undergraduate Major                  Physician Assistant
Starting Median Salary                         74,300.00
Mid-Career Median Salary                       91,700.00
Mid-Career 10th Percentile Salary              66,400.00
Mid-Career 90th Percentile Salary             124,000.00
Group                                               STEM
Name: 43, dtype: object

**Find college major with highest mid-career salary - how much do graduates with this major earn?**

In [ ]:
clean_df['Mid-Career Median Salary'].max()

107000.0

In [ ]:
clean_df['Mid-Career Median Salary'].idxmax()

8

In [ ]:
clean_df.loc[8]

Undergraduate Major                  Chemical Engineering
Starting Median Salary                          63,200.00
Mid-Career Median Salary                       107,000.00
Mid-Career 10th Percentile Salary               71,900.00
Mid-Career 90th Percentile Salary              194,000.00
Group                                                STEM
Name: 8, dtype: object

**Find college major with lowest starting salary**

In [ ]:
clean_df['Starting Median Salary'].min()

34000.0

In [ ]:
clean_df['Starting Median Salary'].idxmin()

49

In [ ]:
clean_df.loc[49]

Undergraduate Major                   Spanish
Starting Median Salary              34,000.00
Mid-Career Median Salary            53,100.00
Mid-Career 10th Percentile Salary   31,000.00
Mid-Career 90th Percentile Salary   96,400.00
Group                                    HASS
Name: 49, dtype: object

**Find college major with lowest mid-career salary**

In [ ]:
clean_df['Mid-Career Median Salary'].min()

52000.0

In [ ]:
clean_df['Mid-Career Median Salary'].idxmin()

18

In [ ]:
clean_df.loc[18]

Undergraduate Major                  Education
Starting Median Salary               34,900.00
Mid-Career Median Salary             52,000.00
Mid-Career 10th Percentile Salary    29,300.00
Mid-Career 90th Percentile Salary   102,000.00
Group                                     HASS
Name: 18, dtype: object

In [ ]:
clean_df.loc[clean_df['Mid-Career Median Salary'].idxmin()]  # this does same as above 2 lines

Undergraduate Major                  Education
Starting Median Salary               34,900.00
Mid-Career Median Salary             52,000.00
Mid-Career 10th Percentile Salary    29,300.00
Mid-Career 90th Percentile Salary   102,000.00
Group                                     HASS
Name: 18, dtype: object

**Lowest risk majors**

Degrees where there is a small difference between the lowest and highest salaries. If the difference between the 10th and 90th percentiles is small, can be more certaina about salary after graduation.

In [ ]:
clean_df['Mid-Career 90th Percentile Salary'] - clean_df['Mid-Career 10th Percentile Salary']  # same as below

In [ ]:
clean_df['Mid-Career 90th Percentile Salary'].subtract(clean_df['Mid-Career 10th Percentile Salary'])

The output above is another Pandas dataframe column. Add this to the existing dataframe using .insert()

In [ ]:
spread_col = clean_df['Mid-Career 90th Percentile Salary'] - clean_df['Mid-Career 10th Percentile Salary']

In [ ]:
clean_df.insert(1, 'Spread', spread_col)  # 1st argument is position of column, pos 1 = second column

In [ ]:
clean_df.head()

     Undergraduate Major  ...     Group
0             Accounting  ...  Business
1  Aerospace Engineering  ...      STEM
2            Agriculture  ...  Business
3           Anthropology  ...      HASS
4           Architecture  ...  Business

[5 rows x 7 columns]

Sorting by the lowest spread

In [ ]:
low_risk = clean_df.sort_values('Spread')

In [ ]:
low_risk[['Undergraduate Major', 'Spread']].head()  # print major and spread value for of sorted spreads (ascending order)

           Undergraduate Major    Spread
40                     Nursing 50,700.00
43         Physician Assistant 57,600.00
41                   Nutrition 65,300.00
49                     Spanish 65,400.00
27  Health Care Administration 66,400.00

**Find degrees with the highest potential**

Top 5 degrees with the highest values in the 90th percentile.

In [ ]:
high_potential = clean_df.sort_values('Mid-Career 90th Percentile Salary', ascending=False)

In [ ]:
high_potential[['Undergraduate Major', 'Mid-Career 90th Percentile Salary']].head()

     Undergraduate Major  Mid-Career 90th Percentile Salary
17             Economics                         210,000.00
22               Finance                         195,000.00
8   Chemical Engineering                         194,000.00
37                  Math                         183,000.00
44               Physics                         178,000.00

**Degrees with the biggest spread in salaries**

In [ ]:
high_risk = clean_df.sort_values('Spread', ascending=False)

In [ ]:
high_risk[['Undergraduate Major', 'Spread']].head()

   Undergraduate Major     Spread
17           Economics 159,400.00
22             Finance 147,800.00
37                Math 137,800.00
36           Marketing 132,900.00
42          Philosophy 132,500.00

**Grouping by degree category: STEM, Business, HASS (Humanities, Arts and Social Science)**

Count the number of majors in each category

In [ ]:
clean_df.groupby('Group').count()

          Undergraduate Major  ...  Mid-Career 90th Percentile Salary
Group                          ...
Business                   12  ...                                 12
HASS                       22  ...                                 22
STEM                       16  ...                                 16

[3 rows x 6 columns]

Average salary by group

In [ ]:
clean_df.groupby('Group').mean()

             Spread  ...  Mid-Career 90th Percentile Salary
Group                ...
Business 103,958.33  ...                         147,525.00
HASS      95,218.18  ...                         129,363.64
STEM     101,600.00  ...                         157,625.00

[3 rows x 5 columns]

**Web scraping PayScale's website for more recent data**

In [ ]:
import requests

In [ ]:
from bs4 import BeautifulSoup

In [ ]:
records = []

for current_page in range(34):
  endpoint = f"https://www.payscale.com/college-salary-report/majors-that-pay-you-back/bachelors/page/{current_page + 1}"
  response = requests.get(endpoint)
  soup = BeautifulSoup(response.text, "html.parser")

  rows = soup.select("table.data-table tbody tr")
  for row in rows:
    cells = row.select("span.data-table__value")
    record = {
        "Undergraduate Major": cells[1].getText(),
        "Starting Median Salary": float(cells[3].getText().strip("$").replace(",", "")),
        "Mid-Career Median Salary": float(cells[4].getText().strip("$").replace(",", "")),
    }
    records.append(record)

pd.DataFrame(records).to_csv("salaries_by_college_major_updated.csv", index=False)

Analysing the new data

In [ ]:
new_df = pd.read_csv("salaries_by_college_major_updated.csv")

In [ ]:
new_df.head()

                                Undergraduate Major  ...  Mid-Career Median Salary
0                             Petroleum Engineering  ...                182,000.00
1  Electrical Engineering & Computer Science (EECS)  ...                152,300.00
2                  Applied Economics and Management  ...                139,600.00
3                               Operations Research  ...                139,600.00
4                                 Public Accounting  ...                138,800.00

[5 rows x 3 columns]

In [ ]:
new_df.shape

(834, 3)

In [ ]:
new_df.tail()

           Undergraduate Major  ...  Mid-Career Median Salary
829  Early Childhood Education  ...                 43,300.00
830              Mental Health  ...                 42,500.00
831          Medical Assisting  ...                 42,300.00
832      Addictions Counseling  ...                 42,200.00
833              Metalsmithing  ...                 38,400.00

[5 rows x 3 columns]

In [ ]:
new_df.isna()  # no NaN values this time, no need to clean

**Highest starting salary**

In [ ]:
new_df['Starting Median Salary'].max()

101200.0

In [ ]:
new_df.loc[new_df['Starting Median Salary'].idxmax()]

Undergraduate Major         Electrical Engineering & Computer Science (EECS)
Starting Median Salary                                            101,200.00
Mid-Career Median Salary                                          152,300.00
Name: 1, dtype: object

**Highest mid-career salary**

In [ ]:
new_df['Mid-Career Median Salary'].max()

182000.0

In [ ]:
new_df.loc[new_df['Mid-Career Median Salary'].idxmax()]

Undergraduate Major         Petroleum Engineering
Starting Median Salary                  92,300.00
Mid-Career Median Salary               182,000.00
Name: 0, dtype: object

**Lowest starting salary**

In [ ]:
new_df['Starting Median Salary'].min()

31000.0

In [ ]:
new_df.loc[new_df['Starting Median Salary'].idxmin()]

Undergraduate Major         Developmental Psychology
Starting Median Salary                     31,000.00
Mid-Career Median Salary                   62,000.00
Name: 707, dtype: object

**Lowest mid-career salary**

In [ ]:
new_df['Mid-Career Median Salary'].min()

38400.0

In [ ]:
new_df.loc[new_df['Mid-Career Median Salary'].idxmin()]

Undergraduate Major         Metalsmithing
Starting Median Salary          38,300.00
Mid-Career Median Salary        38,400.00
Name: 833, dtype: object